app/controllers/posts_controller.rb

  def show
    if params[:author_id]
      @post = Author.find_by(id: params[:author_id]).posts.find_by(id: params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]

  def update
    @post = Post.find(params[:id])
    @post.update(params.require(:post))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "New post, who dis? Editing coz i can."], ["updated_at", "2018-07-22 03:07:55.683400"], ["id", 9]]